In [1]:
import pandas as pd
import numpy as np 
y = np.arange(12).reshape(4, 3)
print(y)

[[ 0  1  2]
 [ 3  4  5]
 [ 6  7  8]
 [ 9 10 11]]

In [2]:
y[(y > 5)] = -1
print(y)

[[ 0  1  2]
 [ 3  4  5]
 [-1 -1 -1]
 [-1 -1 -1]]

In [3]:
import numpy as np
x = np.array([[2, 4], [5, 1]])
print(x)
z = np.ones_like(x)
print(z)

[[2 4]
 [5 1]]
[[1 1]
 [1 1]]

In [4]:
w = np.eye(2)* x
print(w)

[[2. 0.]
 [0. 1.]]

In [5]:
import pandas as pd
Series1 = {
    "A" : 1, 
    "B" : 2, 
    "C" : 3, 
    "D" : 4, 
}

Series2 = {
    "A" : 5, 
    "B" : 6, 
    "D" : 7, 
    "E" : 8, 
}
S1 = pd.Series(Series1)
S2 = pd.Series(Series2)
S2[: : -1]*5

E    40
D    35
B    30
A    25
dtype: int64

In [6]:
list = [[5, 10, 20], 
         [20, 13, 43], 
         [34, 27, 67], 
         [12, 46, 77]]
import numpy as np 
matrix = np.array(list)
matrix

array([[ 5, 10, 20],
       [20, 13, 43],
       [34, 27, 67],
       [12, 46, 77]])

In [7]:
transpose = matrix.T

In [8]:
matrix[:1, 1:]

array([[10, 20]])

In [9]:
matrix[[1, 3, 0], [2, 1, 0]]

array([43, 46,  5])

In [10]:
matrix[[-2, -4]]

array([[34, 27, 67],
       [ 5, 10, 20]])

In [11]:
matrix[[True, False, False, True]]

array([[ 5, 10, 20],
       [12, 46, 77]])

In [12]:
matrix [3] [:2]

array([12, 46])

In [13]:
matrix[::-1]

array([[12, 46, 77],
       [34, 27, 67],
       [20, 13, 43],
       [ 5, 10, 20]])

In [14]:
matrix.ndim

2

In [15]:
swapped = np.swapaxes(matrix, 1, 0)
swapped

array([[ 5, 20, 34, 12],
       [10, 13, 27, 46],
       [20, 43, 67, 77]])

In [16]:
matrix + 10

array([[15, 20, 30],
       [30, 23, 53],
       [44, 37, 77],
       [22, 56, 87]])

In [17]:
# import pandas as pd
# data = {"ONE" : [1, 34, , 34], 
#        "TWO": [14, 21, 23, 21], 
#        "THREE" : [34, , , 32], 
#        "FOUR" : [, , , ,]}
# df = pd.DataFrame(data)
# df

In [18]:
mat = np.array([[[-1.0, 2], [3, 4]], [[-5, 6],  [7, 8]]])
mat

array([[[-1.,  2.],
        [ 3.,  4.]],

       [[-5.,  6.],
        [ 7.,  8.]]])

In [19]:
matlike = np.zeros_like(mat)
matlike

array([[[0., 0.],
        [0., 0.]],

       [[0., 0.],
        [0., 0.]]])

In [20]:
print(mat.shape)

(2, 2, 2)

In [21]:
print(mat.dtype)

float64

In [27]:
mat *25

array([[[ -25.,   50.],
        [  75.,  100.]],

       [[-125.,  150.],
        [ 175.,  200.]]])

In [2]:
import pandas as pd
student = pd.read_csv("question.csv")
student

   Year   Name  Roll No  Marks  Age
0     1   Rani       23     70   18
1     2   Rita       24     75   20
2     3    Raj       25     80   22
3     1  Rahul       26     65   25
4     2  Rohit       27     80   28

In [3]:
student[['Roll No', 'Name']][2:4]

   Roll No   Name
2       25    Raj
3       26  Rahul

In [4]:
student[student['Age'] > 20]

   Year   Name  Roll No  Marks  Age
2     3    Raj       25     80   22
3     1  Rahul       26     65   25
4     2  Rohit       27     80   28

In [5]:
student[student['Age'] > 20]['Name']

2      Raj
3    Rahul
4    Rohit
Name: Name, dtype: object

In [10]:
import numpy as np
avg_marks = np.mean(student.Marks)
student[student['Marks'] > avg_marks]

   Year   Name  Roll No  Marks  Age
1     2   Rita       24     75   20
2     3    Raj       25     80   22
4     2  Rohit       27     80   28

In [12]:
first = student[student['Year'] == 1]["Marks"]
np.mean(first)

np.float64(67.5)

In [16]:
arr = np.array([89, 54, 76, 32, 47, 21, 92, 39, 82])
arr1 = arr[5:9]
arr2 = arr[5:9].copy()
arr1 = 36
arr2 = 7
print(arr2)

7

In [21]:
a =pd.Series([4,1,7,1,8,9,0,8,2,3,9])
a.rank()

0      6.0
1      2.5
2      7.0
3      2.5
4      8.5
5     10.5
6      1.0
7      8.5
8      4.0
9      5.0
10    10.5
dtype: float64

In [18]:
a.rank(method = 'first')

0      6.0
1      2.0
2      7.0
3      3.0
4      8.0
5     10.0
6      1.0
7      9.0
8      4.0
9      5.0
10    11.0
dtype: float64

In [19]:
a.rank(ascending = False)

0      6.0
1      9.5
2      5.0
3      9.5
4      3.5
5      1.5
6     11.0
7      3.5
8      8.0
9      7.0
10     1.5
dtype: float64

In [2]:
import pandas as pd 
import numpy as np
employee_data = {
    "Name" : ["Sangeeta", "Sarika", "Sangeeta", "Babita", "Sarika"], 
    "Age" : [18, 30, 45, 50, 32]
}
df = pd.DataFrame(employee_data)
df

       Name  Age
0  Sangeeta   18
1    Sarika   30
2  Sangeeta   45
3    Babita   50
4    Sarika   32

In [10]:
distinct_names = df["Name"].unique()
len(distinct_names)

3

In [13]:
average_age_of_sangeeta_name = df[df["Name"] == "Sangeeta"]["Age"].mean() 
average_age_of_sangeeta_name

np.float64(31.5)

In [18]:
section1_data = {
    "Roll No" : [1, 2, 3, 4], 
    "Name" : ["Abhav", "Vihaan", "Chitra", "Devansh"]
}

section2_data = {
    "Roll No" : [1, 5, 3, 2],
    "Name" : ["Roni", "Kabeer", "Ishani", "Vihaan"]
}

section1 = pd.DataFrame(section1_data)
section2 = pd.DataFrame(section2_data)
section1

   Roll No     Name
0        1    Abhav
1        2   Vihaan
2        3   Chitra
3        4  Devansh

In [20]:
[section1["Name"] == section2["Name"]]
df = pd.DataFrame([section1["Name"] == section2["Name"]])
df

          0      1      2      3
Name  False  False  False  False

In [36]:
import numpy as np
a1 = np.zeros((2, 3))
a2 = [[3, 4, 5], [7, 8, 9]]
al = np.append(a1, a2, axis=0)
print(al)

(4, 3)

In [37]:
empSalary = [20000, 10000, 2000, 4500, 6000, 4800, 50000, 4000, 8000, 30000]
arr = np.array(empSalary)
arr

array([20000, 10000,  2000,  4500,  6000,  4800, 50000,  4000,  8000,
       30000])

In [41]:
poorSalary = arr[arr > 5000]
len(poorSalary)

6

In [50]:
incentives = arr * 0.1
incentives

array([2000., 1000.,  200.,  450.,  600.,  480., 5000.,  400.,  800.,
       3000.])

In [47]:
incentives

array([2000., 1000.,  200.,  450.,  600.,  480., 5000.,  400.,  800.,
       3000.])

In [51]:
students = {
    "Name" : ["Mohan", "Sohan", "Rajeev", "Jeevan", "Gita", "Meenu", "Gopal"], 
    "Hours_studied" : [2.5, 4.0, 6.0, 8.0, 10.0, 1.0, 5.0],
    "Marks_obtained" : [40, 52, 64, 70, 90, 10, 60]
 }
df_student = pd.DataFrame(students)
df_student

     Name  Hours_studied  Marks_obtained
0   Mohan            2.5              40
1   Sohan            4.0              52
2  Rajeev            6.0              64
3  Jeevan            8.0              70
4    Gita           10.0              90
5   Meenu            1.0              10
6   Gopal            5.0              60

In [57]:
topper = [df_student["Marks_obtained"].max()]
topper_name = df_student[df_student["Marks_obtained"] == 90].Name
topper_name

4    Gita
Name: Name, dtype: object

In [ ]:
mean_hours_